# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

print("Введите трехзначное число: ")
a = int(input())
n = a % 10
m1 = a // 10
m = m1 % 10
k = a // 100
print(k,'+',m,'+',n,'=',k+m+n)
